load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 10
      name: 10/s
    - duration: 30
      arrivalRate: 100
      name: 100/s
    - duration: 30
      arrivalRate: 1000
      name: 1000/s
    - duration: 30
      arrivalRate: 10000
      name: 10000/s

scenarios:
  - name: "test"
    flow:
      - get:
          url: "/"