load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 15
      arrivalRate: 100
      name: 100/s
    - duration: 5
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 100
      name: 100/s
    - duration: 5
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 100
      name: 100/s
    - duration: 5
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 100
      name: 100/s

scenarios:
  - name: "test"
    flow:
      - get:
          url: "/"