load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 15
      arrivalRate: 10
      name: 10/s
    - duration: 3
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 10
      name: 10/s
    - duration: 3
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 10
      name: 10/s
    - duration: 3
      arrivalRate: 5000
      name: 5000/s
    - duration: 15
      arrivalRate: 10
      name: 10/s

scenarios:
  - name: "test"
    flow:
      - get:
          url: "/"