load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 5
      name: 5/s
    - duration: 30
      arrivalRate: 20
      name: 20/s
    - duration: 30
      arrivalRate: 50
      name: 50/s
    - duration: 30
      arrivalRate: 200
      name: 200/s
    - duration: 30
      arrivalRate: 500
      name: 500/s

scenarios:
  - name: "test"
    flow:
      - get:
          url: "/"